// 3.15 (بازی: لاتری)
// برنامه‌ای در جاوااسکریپت بنویسید که یک عدد تصادفی سه‌رقمی تولید کند و از کاربر بخواهد یک عدد سه‌رقمی وارد کند، سپس بر اساس قوانین (کاملاً درست، همه ارقام ولی جابجا، یا یک رقم مشترک) مقدار جایزه را مشخص کند.

var a = Math.floor(Math.random() * 3)

alert(a)
var b = prompt('enter a number')

if (a == b){
    alert('مساوی')
}else if (a == 0 && b == 2){
    alert('کاربر ببرد')
}else if (a == 1 && b == 0){
    alert('کاربر بای داد')
}else if (a == 2 && b == 1){
    alert('کاربر دوباره بای داد')
}else{
    alert('bad')
}




