// //3.13 (کاربرد مالی: محاسبه مالیات)
// برنامه‌ای در جاوااسکریپت بنویسید که نرخ مالیات را برای وضعیت‌های مختلف (single, married …) محاسبه کند.


//3.16 (نقطه تصادفی) برنامه‌ای در جاوااسکریپت بنویسید که یک مختصات تصادفی در مستطیل با مرکز (0,0) و ابعاد 100×200 تولید و نمایش دهد.


// 3.21 (روز هفته – الگوریتم Zeller)
// برنامه‌ای در جاوااسکریپت بنویسید که سال، ماه و روز را از کاربر بگیرد و نام روز هفته را محاسبه و نمایش دهد.


// 3.22 (هندسه: نقطه در دایره؟)
// برنامه‌ای در جاوااسکریپت بنویسید که مختصات یک نقطه را بگیرد و بررسی کند آیا داخل دایره با مرکز (0,0) و شعاع 10 قرار دارد یا نه.



// 3.23 (هندسه: نقطه در مستطیل؟)
// برنامه‌ای در جاوااسکریپت بنویسید که مختصات یک نقطه را بگیرد و بررسی کند آیا داخل مستطیل با مرکز (0,0)، عرض 10 و ارتفاع 5 قرار دارد یا نه.