//3.7 (کاربرد مالی: واحدهای پولی) برنامه‌ای در جاوااسکریپت بنویسید که مقدار پول (به سنت) بگیرد و فقط مقادیر غیرصفر را به شکل درست نمایش دهد. برای یک واحد از حالت مفرد (1 dollar, 1 penny) و برای چند واحد از حالت جمع استفاده کند.


//3.9 (بررسی ISBN-10) برنامه‌ای در جاوااسکریپت بنویسید که 9 رقم اول یک شماره ISBN-10 را بگیرد و رقم دهم (Checksum) را محاسبه و شماره کامل را نمایش دهد.




// 3.11 (تعداد روزهای یک ماه)
// برنامه‌ای در جاوااسکریپت بنویسید که ماه و سال را از کاربر بگیرد و تعداد روزهای آن ماه را نمایش دهد (با در نظر گرفتن سال کبیسه).


// //3.13 (کاربرد مالی: محاسبه مالیات)
// برنامه‌ای در جاوااسکریپت بنویسید که نرخ مالیات را برای وضعیت‌های مختلف (single, married …) محاسبه کند.


//3.16 (نقطه تصادفی) برنامه‌ای در جاوااسکریپت بنویسید که یک مختصات تصادفی در مستطیل با مرکز (0,0) و ابعاد 100×200 تولید و نمایش دهد.


// 3.21 (روز هفته – الگوریتم Zeller)
// برنامه‌ای در جاوااسکریپت بنویسید که سال، ماه و روز را از کاربر بگیرد و نام روز هفته را محاسبه و نمایش دهد.


// 3.22 (هندسه: نقطه در دایره؟)
// برنامه‌ای در جاوااسکریپت بنویسید که مختصات یک نقطه را بگیرد و بررسی کند آیا داخل دایره با مرکز (0,0) و شعاع 10 قرار دارد یا نه.



// 3.23 (هندسه: نقطه در مستطیل؟)
// برنامه‌ای در جاوااسکریپت بنویسید که مختصات یک نقطه را بگیرد و بررسی کند آیا داخل مستطیل با مرکز (0,0)، عرض 10 و ارتفاع 5 قرار دارد یا نه.